## <font color = blue> Pandas

### <font color = blue> Table creation for visualisation

In [1]:
#!pip install tabulate

Collecting tabulate
  Using cached tabulate-0.8.9-py3-none-any.whl (25 kB)
Installing collected packages: tabulate
Successfully installed tabulate-0.8.9

In [2]:
import numpy as np
import pandas as pd
from tabulate import tabulate as tb

In [3]:
table = [['Srn','Objective','Method'], [1, 'To create dataframe', 'df=pd.DataFrame()']]

In [9]:
print(tb(table, headers='firstrow',tablefmt='fancy_grid'))

╒═══════╤═════════════════════╤═══════════════════╕
│   Srn │ Objective           │ Method            │
╞═══════╪═════════════════════╪═══════════════════╡
│     1 │ To create dataframe │ df=pd.DataFrame() │
╘═══════╧═════════════════════╧═══════════════════╛

## <font color = blue> I DataFrame Creation

### <font color = blue> 1. Creating dataframe from list and tuple

Similar way to create dataframe from list and tuple

In [14]:
l1 = ['Pravin','Radhika','Rutvik']
df1 = pd.DataFrame(l1,index = [1,2,3],)
df1

         0
1   Pravin
2  Radhika
3   Rutvik

In [16]:
# Multiple column table
name = ['Pravin','Radhika','Rutvik']
dept= ['Mechanical','Computer','AI']
df2 = pd.DataFrame(list(zip(name,dept)),index=[1,2,3], columns=['Name','Department'])
df2

      Name  Department
1   Pravin  Mechanical
2  Radhika    Computer
3   Rutvik          AI

In [19]:
# Creating Dataframe from nested list
name_dept = [['Pravin','Mechanical'],['Radhika','Computer'],['Rutvik','AI']]
df3 = pd.DataFrame(name_dept,index=[1,2,3], columns=['Name','Department'])
df3

      Name  Department
1   Pravin  Mechanical
2  Radhika    Computer
3   Rutvik          AI

### <font color = blue> 2. Creating dataframe from dictionary

In [29]:
# Creating dataframe from dictionary
name = ['Pravin','Radhika','Rutvik']
dept= ['Mechanical','Computer','AI']
d1 = {'Name':name,'Dept':dept}
df1 = pd.DataFrame(d1,index=[1,2,3])
df1

      Name        Dept
1   Pravin  Mechanical
2  Radhika    Computer
3   Rutvik          AI

In [36]:
# Dataframe from dictionary, values as list
details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
  
df2 = pd.DataFrame(details, columns = ['Name', 'University'])
  
df2

        Name University
0      Ankit        BHU
1  Aishwarya        JNU
2    Shaurya         DU
3   Shivangi        BHU

In [41]:
# Dataframe from nested dictionary
details = {
    0 : {'Name' : 'Ankit','Age' : 22,'University' : 'BHU'},
    1 : {'Name' : 'Aishwarya','Age' : 21,'University' : 'JNU'},
    2 : {'Name' : 'Shaurya','Age' : 23,'University' : 'DU'}
            }

df3 = pd.DataFrame(details)
df3

                0          1        2
Name        Ankit  Aishwarya  Shaurya
Age            22         21       23
University    BHU        JNU       DU

### <font color = blue> 3. Filling empty dataframe

In [43]:
df = pd.DataFrame()
df['Name'] = ['Pravin','Radhika','Rutvik']
df['dept'] = ['Mechanical','Computer','AI']
df

      Name        dept
0   Pravin  Mechanical
1  Radhika    Computer
2   Rutvik          AI

### <font color = blue> 4. Dataframe from csv / excel

In [51]:
df_iris = pd.read_csv(r'D:\Data Science\Jupyter\Notes\ML\Ada Boost\Class\Adaboost Algorithm\Iris.csv')
df_iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

### <font color = blue> 5. Dataframe Numpy Array

In [50]:
# Dataframe from array
array = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(array)
df

   0  1  2
0  1  2  3
1  4  5  6

### <font color = blue> 6. Dataframe by importing datafrom MySQL

### <font color = blue> 7. Dataframe by importing datafrom MongoDB

## <font color = blue> II Basic Operations

In [65]:
# Basic Operations

# Display functions
df_iris.head()   # displays top rows
df_iris.tail()   # display tail rows
df_iris.sample(5) # display random rows

# Information about dataframe
df_iris.info()
df_iris.shape
df_iris.columns
df_iris.axes

# Statistical Information
df_iris.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

## <font color = blue> III Writting Data to csv and excel

In [72]:
# writting data to csv
df_iris.describe().to_csv('Describe.csv')

# writting data to Excel
df_iris.describe().to_excel('Describe.xlsx')

# writting data to html >> creats a table to display on web
df_iris.describe().to_html('s.html')

# apart from above, there are other methods..........can be explorred

## <font color = blue> IV Dataframe Slicing

### <font color = blue> 1 Dataframe Slicing

In [77]:
# Slicing dataframe column wise
df1 = df_iris[['Species','SepalLengthCm']]
df1.head()

       Species  SepalLengthCm
0  Iris-setosa            5.1
1  Iris-setosa            4.9
2  Iris-setosa            4.7
3  Iris-setosa            4.6
4  Iris-setosa            5.0

In [78]:
# Slicing dataframe column wise as well as row wise
df1 = df_iris[['Species','SepalLengthCm']][2:5]
df1.head()

       Species  SepalLengthCm
2  Iris-setosa            4.7
3  Iris-setosa            4.6
4  Iris-setosa            5.0

### <font color = blue> 2 Dataframe Slicing with loc and iloc
    
    df.loc[] : can take parameter as string as well as numeric
    df.iloc[]: can take only numeric parameters

In [83]:
#df_iris.loc[:,['SepalLengthCm','SepalWidthCm','Species']]  # All the rows and selected columns

In [85]:
#df_iris.loc[10:50,['SepalLengthCm','SepalWidthCm','Species']]  # selected rows and selected columns

In [87]:
#df_iris.iloc[:,:]  # All the rows and all the columns

In [89]:
#df_iris.iloc[:,3:5]  # All the rows and selected the columns

In [92]:
#df_iris.iloc[10:20,:]  # selected rows and all the columns

In [95]:
# conditional splitting with loc
df_iris.loc[df_iris['Species']=='Iris-setosa'].head(5)  # All the rows and columns where species == Iris-Setosa

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [96]:
# conditional splitting with loc
df_iris.loc[df_iris['SepalLengthCm']>5.1].head(5)  # All the rows and columns where species == Iris-Setosa

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5    6            5.4           3.9            1.7           0.4  Iris-setosa
10  11            5.4           3.7            1.5           0.2  Iris-setosa
14  15            5.8           4.0            1.2           0.2  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa

## <font color = blue> V Set & Reset Index

In [105]:
# Setting Index
students = [['jack', 34, 'Sydeny', 'Australia',85.96],
            ['Riti', 30, 'Delhi', 'India',95.20],
            ['Vansh', 31, 'Delhi', 'India',85.25],
            ['Nanyu', 32, 'Tokyo', 'Japan',74.21],
            ['Maychan', 16, 'New York', 'US',99.63],
            ['Mike', 17, 'las vegas', 'US',47.28]]

# Create a DataFrame object
df = pd.DataFrame(students,columns=['Name', 'Age', 'City', 'Country','Agg_Marks'],index=['a', 'b', 'c', 'd', 'e', 'f'])

df = df.set_index('Agg_Marks')

df

              Name  Age       City    Country
Agg_Marks
85.96         jack   34     Sydeny  Australia
95.20         Riti   30      Delhi      India
85.25        Vansh   31      Delhi      India
74.21        Nanyu   32      Tokyo      Japan
99.63      Maychan   16   New York         US
47.28         Mike   17  las vegas         US

In [108]:
# Reset Index
df.reset_index(drop=True)

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vansh   31      Delhi      India
3    Nanyu   32      Tokyo      Japan
4  Maychan   16   New York         US
5     Mike   17  las vegas         US

## <font color = blue> VI Transpose DataFrame

In [110]:
# Transpose
df.T

Agg_Marks      85.96  95.20  85.25  74.21     99.63      47.28
Name            jack   Riti  Vansh  Nanyu   Maychan       Mike
Age               34     30     31     32        16         17
City          Sydeny  Delhi  Delhi  Tokyo  New York  las vegas
Country    Australia  India  India  Japan        US         US

## <font color = blue> VII Sort DataFrame

In [117]:
df = df.reset_index(drop=True)
df

# sort by index
df.sort_index(axis=0, inplace=True)
df

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vansh   31      Delhi      India
3    Nanyu   32      Tokyo      Japan
4  Maychan   16   New York         US
5     Mike   17  las vegas         US

In [118]:
# sort by values
df.sort_values('City')
df

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vansh   31      Delhi      India
3    Nanyu   32      Tokyo      Japan
4  Maychan   16   New York         US
5     Mike   17  las vegas         US

## <font color = blue> VIII drop row and columns

In [121]:
# Dataframe creation
df_emp = pd.read_csv('Emp_Records.csv')
emp = df_emp.copy()
emp.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,NaN,13.68,168251,NaN
1,940761,Brenda,47.02,NaN,NaN,51063,Stonewall
2,428945,Joe,54.15,68.0,0.98,50155,Michigantown
3,408351,Diane,39.67,NaN,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58.0,4.01,117642,Fremont

In [138]:
df1 = emp.drop(['Emp ID', 'First Name'], axis = 1)  # dropping the selected columns
df1.head()

   Age in Yrs  Weight in Kgs  Age in Company  Salary          City
0       36.36            NaN           13.68  168251           NaN
1       47.02            NaN             NaN   51063     Stonewall
2       54.15           68.0            0.98   50155  Michigantown
3       39.67            NaN           18.30  180294      Hydetown
4       40.31           58.0            4.01  117642       Fremont

In [137]:
# Delecting selected rows
df2 = emp.drop([0,1,2,3,4], axis = 0)
df2.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
5,499687,Patrick,34.86,58.0,12.02,72305,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189,Atlanta
7,380086,Carol,59.12,40.0,34.52,60918,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587,Delmita
9,162402,Diana,29.73,60.0,3.44,43010,Eureka Springs

In [146]:
df2.loc[df2['City']=='Macksburg']

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
5,499687,Patrick,34.86,58.0,12.02,72305,Macksburg

## <font color = blue> IX Min, Max, Sum, Mean, Mode and Median

In [163]:
max(df2.Salary)
min(df2.Salary)

df2.mean()          # returns mean for all columns of the dataframe
df2.Salary.mean()   # returns mean for selected columns of the dataframe

df2.median()
df2.Salary.median()

# Mode

from statistics import mode
from scipy import stats

df2['Age in Company'].mode()

C:\Users\Swami\AppData\Local\Temp/ipykernel_21640/17518926.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df2.mean()          # returns mean for all columns of the dataframe
C:\Users\Swami\AppData\Local\Temp/ipykernel_21640/17518926.py:7: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df2.median()

0    4.93
dtype: float64

## <font color = blue> X Finding  & Dropping NA in dataframe

### <font color = blue> 1 Finding NA in dataframe

In [169]:
# isna()
emp.isna()  # returns T/F for complete df
emp.isna().sum() # returns no of na in each coumns

# isnull()
emp.isnull()  # returns T/F for complete df
emp.isnull().sum() # returns no of na in each coumns

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    1
Salary            0
City              1
dtype: int64

### <font color = blue> 2 Finding NA in dataframe

In [181]:
df3 = emp

In [184]:
# dropping all the na from dataframe
df3 = df3.dropna(axis=0)
df3.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     0
Age in Company    0
Salary            0
City              0
dtype: int64

In [187]:
df3 = emp
# dropping the na from dataframe with given threshould. 
df3 = df3.dropna(axis=0,thresh=5)     #to drop vertically, there should be minimum 5 na
df3.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    1
Salary            0
City              1
dtype: int64

In [188]:
df3 = emp
# dropping the na from dataframe with given threshould. 
df3 = df3.dropna(axis=1,thresh=5)     # #We need 5 non null values along the columns now. (axis=1)
df3.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    1
Salary            0
City              1
dtype: int64

## <font color = blue> XI Unique, nunique and value_counts- Works on rows

In [190]:
# Unique: returns unique labels
df3.City.unique()

array([nan, 'Stonewall', 'Michigantown', 'Hydetown', 'Fremont',
       'Macksburg', 'Atlanta', 'Blanchester', 'Delmita', 'Eureka Springs',
       'Sabetha', 'Las Vegas', 'New Matamoras', 'Maida', 'Quecreek',
       'Beulaville', 'New Douglas', 'Toeterville', 'Primm Springs',
       'Dutchtown', 'Shreveport', 'Heathsville', 'Middleport', 'Woodbury',
       'Saint Cloud', 'Stockholm', 'Manning', 'Mount Vernon',
       'Lawrenceburg', 'Mesa', 'Panacea', 'Kline', 'Bonanza', 'Liberty',
       'Ohatchee', 'Nashville', 'Eckerty', 'Lima', 'Wright', 'Ellsworth',
       'Conroy', 'Lake Charles', 'Kalvesta', 'Knoxville', 'Rochester',
       'Bowling Green', 'Uniontown', 'Topeka', 'New York City', 'Banner',
       'East Saint Louis', 'Hancock', 'Eatontown', 'Portage', 'Oneida',
       'Bartley', 'Arlee', 'Cookeville', 'Saxe', 'Mc Calla', 'Trego',
       'Blair', 'Riverside', 'Maxwell', 'Randallstown', 'Willow Beach',
       'Granger', 'Alcoa', 'Baton Rouge', 'Browning', 'Hudson',
       'Kansas City', 'Haswell', 'Eckert', 'Blue River', 'Albion', 'Bays',
       'Nardin', 'Mary Esther', 'Wheaton', 'Margie', 'Glidden',
       'Saranac Lake', 'Philadelphia', 'Jarreau', 'Wichita', 'Meno',
       'Oriskany', 'Richmond Dale', 'Miami', 'Racine', 'Atqasuk',
       'Whiteman Air Force Base', 'Independence', 'Mapleton', 'Biloxi',
       'Carol Stream', 'Detroit', 'Mc Grath', 'Alma'], dtype=object)

In [191]:
# NUnique returns the sum of the uniue labels
df3.City.nunique()

99

In [193]:
# Retuens categorical counts
df3.City.value_counts()

Stonewall       1
Albion          1
Eckert          1
Haswell         1
Kansas City     1
               ..
Kline           1
Panacea         1
Mesa            1
Lawrenceburg    1
Alma            1
Name: City, Length: 99, dtype: int64